[
  [
    "Timestamp",
    "Name",
    "School Id",
    "Title",
    "Video link",
    "Summary",
    "Github final project link",
    "Honor code declaration"
  ],
  [
    "2025-12-24T06:27:15.784Z",
    "(126) 魏秀芳",
    "411473126",
    "Top-Rated IMDb Movies Data Analysis - Final Project",
    "https://youtu.be/fYETH2eDvDQ",
    "This project consists of a video explaining the summary of dataset and analysis of movie popularity and rating from IMDb and a shared google drive link containing the codebook file, CSV file, and EDA of the project.",
    "https://drive.google.com/drive/folders/19w9Fe88iGzBmsAgxX73gy_ZqdvTv5N2h",
    [
      "I agree."
    ]
  ],
  [
    "2025-12-24T07:24:03.586Z",
    "(119) 王梓縈",
    "411473119",
    "台灣禮儀業合法業者分析",
    "https://youtu.be/hB-t7gjYf0Q",
    "透過政府資料公開平台取的資料並透過ai輔助分析各縣市禮儀業者的數量以及其成立的年份，並透過這些資料探討禮儀業者的分布以及其成立的年份分布。",
    "https://drive.google.com/drive/folders/1LdtUXZF7cGnULyZwwlpX3k0_A0XXAu6f?usp=sharing",
    [
      "I agree."
    ]
  ],
  [
    "2025-12-25T07:53:04.960Z",
    "(125) 鄧金沛",
    "411473125",
    "data analysis bank additional",
    "https://youtu.be/UBr4Kt0-8Vw?si=F5NkXeB8t0e86K7k",
    "the campaign's current strategy is inefficient, as the highest volume of outreach occurs in May despite March, September, and December yielding significantly higher conversion rates (exceeding 50%). Effectiveness is further driven by communication channels, where cellular contacts outperform landlines by nearly triple, and by customer history, where previous subscribers show a massive 65% success rate compared to just 8.8% for new leads. Finally, identified a clear \"Contact Cap,\" showing that any outreach beyond the fourth attempt results in diminishing returns, suggesting that the most profitable strategy focuses on mobile-first, repeat customers during key seasonal windows while strictly limiting the number of call attempts.",
    "https://drive.google.com/drive/folders/1uSMm7lKoUSqjeKnlp63TIvhnHr27ydcb?usp=drive_link",
    [
      "I agree."
    ]
  ],
  [
    "2025-12-26T04:38:52.847Z",
    "(068) 葉冠宏",
    "411473068",
    "台灣鄉鎮市區平日夜間人口與假日夜間人口的落差",
    "https://youtu.be/ZBnb1QgyGZg?si=sCm7ZTkXL3SsHe2g",
    "此專案在於了解台灣鄉鎮市區平日夜間人口與假日夜間人口的落差，並且使用R語言的sf套件來繪製出面量圖，該面量圖用以顯示結果。",
    "https://drive.google.com/drive/folders/1shBsy2ZiVHu7uMbsYXvwMCyYErsrJbwB?usp=drive_link",
    [
      "I agree."
    ]
  ]
]